<template>
  <div id="root">
      <Transition name="modal">
        <div v-if="show" class="modal-mask">
          <div class="modal-wrapper">
            <div class="modal-container">
              <div class="modal-header">
                <slot name="header">
                  <h2 class="header header-2"> 
                    <button 
                      class="modal-close-btn" 
                      @click="$emit('close')"
                    >                      
                       <svg width="14" height="24" viewBox="0 0 14 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path d="M0.939355 10.9393C0.353569 11.5251 0.353569 12.4749 0.939355 13.0607L10.4853 22.6066C11.0711 23.1924 12.0208 23.1924 12.6066 22.6066C13.1924 22.0208 13.1924 21.0711 12.6066 20.4853L4.12134 12L12.6066 3.51472C13.1924 2.92893 13.1924 1.97919 12.6066 1.3934C12.0208 0.807613 11.0711 0.807613 10.4853 1.3934L0.939355 10.9393ZM4.00002 10.5H2.00002V13.5H4.00002V10.5Z" fill="white"/>
                       </svg>
                    </button>

                    АМЕРИКАНО ☕
                  </h2>

                </slot>
              </div>
              <div class="modal-body">
                  <!-- Main content here: -->
                <slot name="body">
                  <!-- INGREDIENTS -->
                  <div class="americano__ingredients-container">
                      <h3 class="header">Ингредиенты:</h3>
                          <ul class="americano__ingredients">
                              <li>
                                 Эспрессо-машина или несколько порций готового эспрессо из кофемашины Nespresso или местной кофейни.
                              </li>
                              <li>
                                  Горячая вода.
                              </li>
                              <li>
                                  Чашка для кофе.
                              </li>
                              <li>
                                  Ваша любимая кружка для кофе.
                              </li>
                              <li>
                                  Свежие цельные кофейные зерна или свежемолотый кофе.
                              </li>
                              <li>
                                  Кофемолка, если вы планируете использовать цельные кофейные зерна.
                              </li>
                              <li>
                                  Кухонные весы для измерения кофейных зерен.
                              </li>
                              <li>
                                 Темпер для упаковки кофейной гущи.
                              </li>
                          </ul>     

                  </div>
                  <hr class="break-line">
                  <!-- // INGREDIENTS // -->

                  <!-- STEP-BY-STEP GUIDE -->
                  <div class="americano__guide-container">
                      <h3 class="americano__guide header">Пошаговая инструкция:</h3>
                      <v-responsive content-class="ingredient-list__mobile">
                        <div class="americano__guide-steps">
                            <div class="americano__guide-first">
                              <ol>
                                <li>
                                   Включите эспрессо-машину: убедитесь, что вы включили эспрессо-машину, прежде чем начать процесс приготовления американо, иначе вы можете некоторое время ждать, пока ваша эспрессо-машина нагреется, особенно если она была полностью холодной.
                                </li>
                                <br>
                                <li>
                                  Отмерьте кофейные зерна: используйте кухонные весы, чтобы отмерить точное количество кофейных зерен, необходимое для приготовления одной, двойной или тройной порции эспрессо, в зависимости от ваших вкусовых предпочтений и размера портафильтра вашей эспрессо-машины.
                                </li>
                                <br>
                                <li>
                                  Мелко смолоть кофейные зерна: поместите точно отмеренные кофейные зерна в кофемолку и измельчите их на минимально возможной скорости. Будьте терпеливы и найдите время, чтобы измельчить бобы очень мелко, пока они не достигнут почти порошкообразной консистенции. Дважды проверьте вес кофе на весах после помола, а затем отложите его в сторону.
                                </li>
                                <br>
                                <li>
                                  Подготовьте контейнеры: промойте насадку на эспрессо-машине. Затем используйте палочку, чтобы нагреть пустую кофейную чашку, которую вы будете использовать для приготовления эспрессо, и кружку, в которой будет находиться горячая вода.
                                </li>
                                <br>
                                <li>
                                  Утрамбуйте кофейную гущу: как только ваша эспрессо-машина нагреется, выньте портафильтр, который должен быть полностью чистым и сухим перед использованием. Насыпьте свежемолотый кофе в портафильтр и плотно утрамбуйте его с помощью темпера. Будьте осторожны, утрамбовывая кофейную гущу — равномерно надавливайте и не давите слишком сильно с одной или другой стороны, иначе получится некачественный эспрессо.
                                </li>
                                <br>
                                <li>
                                  Приготовьте свой эспрессо: независимо от того, решили ли вы приготовить одиночную, двойную или тройную порцию эспрессо, она будет приготовлена за одинаковое время, а двойная и тройная порции получатся крепче. Сделайте порцию эспрессо в соответствии с настройками кофемашины, используя теплую кофейную чашку, чтобы поймать эспрессо.
                                </li>
                                <br>
                                <li>
                                  Нагрейте воду: решите, сколько воды вы хотите добавить в эспрессо, в зависимости от того, как вам нравится американо, крепости эспрессо и размера вашей кружки. Традиционно количество воды, используемой в американо, в два раза превышает количество используемого эспрессо, поэтому нагревайте 2 унции воды на каждую унцию эспрессо, которую вы планируете использовать.
                                </li>
                                <br>

                                <li>
                                   Смешайте эспрессо и воду: обязательно добавляйте эспрессо в горячую воду, а не наоборот. Добавление воды в эспрессо может привести к ожогу эспрессо, если вода слишком горячая. Но добавление эспрессо в воду сохраняет пенку — сливочную пену поверх эспрессо — и позволяет воде равномерно смягчать эспрессо, создавая в целом более однородную смесь.
                                </li>
                                <br>

                                <li>
                                  Добавьте свои добавки: стандартный американо — это только эспрессо и вода без ароматизаторов или начинки. Но если вы хотите немного оживить традиционный напиток, не стесняйтесь посыпать корицей, выдавить в него немного меда, влить немного молока и сахара, добавить немного ванили или даже ложку взбитых сливок — варианты ограничены только вашей фантазией. Поэкспериментируйте с персонализацией домашнего американо, чтобы создать новый фирменный напиток.
                                </li>
                                <br>

                                <li>
                                  Наслаждайтесь: вы только что успешно приготовили свой первый американо дома! Отпразднуйте глотком кофеина и приготовьтесь к прекрасному утру.
                                </li>
                              </ol>
                            </div>


                          <div class="americano__guide-second">
                                <!-- OPTIONAL -->
                          </div>
                        </div>
                      </v-responsive>
                  </div>
                          <hr class="break-line">
                  <!-- // STEP-BY-STEP GUIDE // -->
                </slot>
              </div>

              <div class="modal-footer">
                  <!-- Modal footer here: -->
                <slot name="footer">
                 
                </slot>
              </div>   <!-- // footer -->
            </div> <!-- // modal container -->
          </div>  <!-- // modal wrapper -->
        </div>
      </Transition>
  </div>
</template>


<script>
export default {
  props: {
    show: Boolean,
  },
};
</script>

<style scoped>
@import url('https://fonts.googleapis.com/css2?family=Nunito&family=Pacifico&display=swap');

#root {
    font-family: 'Nunito',sans-serif;
    font-size: 35px;
    color: #fff;
}

.americano__ingredients {
    font-size: 17px;
    margin-left: 2.5rem;
}

.americano__guide-steps {
    display: flex;
    flex-direction: column;
    align-content: space-between;
    word-break: break-all;
    font-size: 25px;
}
.americano__guide-first {
    margin-left: 25px;
    font-size: 20px;
}


.americano__ingredients-container {
  
}

/* RESPONSIVE: */

</style>